/********************************************************************************
 * @file template_sort.hpp
 * @author lxy (2305195328@qq.com)
 * @brief 随机数组,默认长度为10,可自定义长度
 * @version 1.0.0
 * @date 2022-10-27
 ********************************************************************************/
#include <iostream>
#include <vector>
#include <time.h>
using namespace std;
/********************************************************************************
 * @brief 用于初始化测试案例
 *
 ********************************************************************************/
class MyArray
{
public:
    /********************************************************************************
     * @brief Construct a new MyArray object
     * 构造长度为10的新MyArray对象
     ********************************************************************************/
    MyArray() { init(10); };
    /********************************************************************************
     * @brief Construct a new My Array object
     * 构造长度为len的新MyArray对象
     * @param  len
     ********************************************************************************/
    MyArray(const int len) { init(len); }
    /********************************************************************************
     * @brief 用迭代器遍历输出所有值
     *
     ********************************************************************************/
    void show()
    {
        for (auto i = this->arr.begin(); i != this->arr.end(); i++)
            cout << *i << " ";
        cout << endl;
    };

private:
    void init(const int len);
    vector<int> arr;
};

void MyArray::init(const int len)
{
    srand((int)time(NULL));
    for (int i = 0; i < len; i++)
        arr.push_back(rand() % 10);
}
